package Seminar_2;
/* Задано уравнение вида q + w = e, q, w, e >= 0. 
* Некоторые цифры могут быть заменены знаком вопроса, например 2? + ?5 = 69. 
* Требуется восстановить выражение до верного равенства. 
* Предложить хотя бы одно решение или сообщить, что его нет.
*/

// Подсказки
// нужно привести строку к такому виду, чтобы можно было ее как-то распарсить
// нужно выделить первое, второе и третье число
// затем найти, где стоят вопросы и затем сгенерировать все числа
// на место ? нужно поставить все возможные числа (от 0 до 9)

public class Task_5 {

    
}
